Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Производный узел будет иметь те же настройки, что и выбранное подключение, однако, их возможно переопределить в мастере настройки узла (при этом настройки подключения, от которого был унаследован узел, не изменятся).
en: The derived node will have the same settings as the selected connection. However, it is possible to redefine them using the Node Wizard (in this case, settings of the connection from which the node has been inherited will not be changed).

source: Пройдем шаги мастера, указав в параметре Имя файла местоположение файла Sales.txt.
en: Follow the wizard steps having specified the Sales.txt file location in the File Name parameter.

source: Пропусками считаются Null-значения.
en: Null values are considered to be null data.

source: Пропуски;
en: Null count;

source: Пропущенные значения интерпретируются как строки с нулевой длиной, т.е. как "".
en: Null values are interpreted as the strings with zero length, namely, as "".

source: Просматривать отчеты должны многие сотрудники из различных подразделений компании: топ-менеджеры, руководители департаментов, специалисты различных отделов и другие.
en: Many employees from different subdivisions must view reports: top managers, heads of departments, specialists of different departments, etc.

source: Проставятся, основываясь на нижней границе
en: They will be assigned according to thе lower bound

source: Противоположное состояние бинарной целевой переменной класса
en: Opposite state of the binary target class variable

source: Процедура повторяется $$k$$ раз, при этом на каждом проходе для проверки выбирается новый блок, а обучение производится на оставшихся.
en: The procedure is repeated $$k$$ times. In this case, the new block is selected for check during each check, wheres the training is performed with the remaining ones.

source: Процедура повторяется N раз, где N-число итераций.
en: The procedure is repeated N times where N is a number of iterations.

source: Процент неправильного отнесение объектов (наблюдений, событий) к одному из заранее известных классов
en: Percentage of incorrect assignment of objects (observations, events) to one of the classes known in advance

source: Процент ошибок классификации на обучающем множестве
en: Percentage of classification errors of the training set

source: Процент — выводится процентное соотношение данного элемента к итоговому результату.
en: Percent: percentage of this element to the final result is displayed.

source: Процент, итог — одновременно выводятся и процентное отношение элемента ко всему итоговому результату, и сам этот результат.
en: Percent, total: both percentage of the element to the final result, and the result as such are displayed at the same time.

source: Процент.
en: Percent.

source: Процесс анализа данных можно разделить на 2 этапа: разработка аналитических моделей и просмотр готовых отчетов.
en: The data analysis process can be divided into 2 stages, namely, development of the analytical models and view of ready reports.

source: Процесс проверки в упрощенном режиме происходит быстрее, однако не гарантирует корректное извлечение данных из XML в случае, если имеются невыявленные ошибки валидации.
en: The simplified check procedure is performed faster, however, it does not secure correct data extraction from XML if there are undetected validation errors.

source: Процесс проверки в упрощенном режиме происходит быстрее, однако не гарантирует корректное извлечение данных из XML ответа сервиса в случае, если имеются невыявленные ошибки валидации.
en: The simplified check procedure is performed faster, however, it does not secure correct data extraction from XML of the service response if there are undetected validation errors.

source: Процесс продолжают, пока не доходят до подзадач, алгоритмы, решения которых очевидны.
en: The process is repeated until definition of subtasks and algorithms solutions of which are obvious.

source: Процесс — иерархически указаны процессы (наименования) и их составные части.
en: Process — processes (names) and their constituents are hierarchically specified.

source: Прочие методы:
en: Other methods:

source: Пт
en: Friday

source: Публикация
en: Publication

source: Публикация и работа созданных в Loginom веб-сервисов доступна при наличии установленного компонента Loginom Integrator.
en: Publication and operation of the web services created in Loginom are available if the Loginom Integrator component is installed.

source: Публикуемый в качестве метода веб-сервиса узел должен иметь следующие настройки:
en: The node published as the web service method must have the following settings:

source: Пул подключений не используется.
en: Connection pool is not used.

source: Пункт На значение заменяет все значения вне Таблицы замен, на введенное в строке.
en: With value option replaces all values outside the Replacement table with the value entered into the row.

source: Пустые записи в агрегации не участвуют, кроме типа Строковый, где пустая запись является наименьшей.
en: The null records are not included into the aggregation, with the exception of String type where the null record is the minimum one.

source: Пусть имеется следующая таблица:
en: Let's consider the following table:

source: Пусть необходимо привести значения к диапазону a, b.
en: Let us assume that it is required to cast values to a, b range.

source: Пути импорта внешних модулей
en: Import Paths of External Modules

source: Пути импорта модулей могут быть относительными или абсолютными.
en: The modules import paths can be relative and absolute.

source: Путь к файлу Пакета внутри файлового хранилища.
en: Path to the Package file inside the file storage.

source: Путь к файлу или пакету внутри файлового хранилища задается относительно папки UserStorage.
en: The path to the file or package in the file storage is set relative to the UserStorage folder.

source: Путь к файлу пакета
en: Path to the package file

source: Работа модулей CommonJS реализована в соответствии со спецификацией, за следующими отличиями:
en: The CommonJS modules are operated according to the specification with the following differences:

source: Работа с Loginom Desktop аналогична Studio, за исключением отсутствующих механизмов интеграции и коллективной работы.
en: Loginom Desktop operation is similar to the Studio operation, with the exception of unavailable mechanisms of integration and teamwork.

source: Работа с веб-сервисами
en: Web Services Operation

source: Работа с построенной диаграммой
en: How to Use the Constructed Chart

source: Работает в связке с IIS, создавая в нем отдельное приложение.
en: It is used in combination with IIS creating a separate application in it.

source: Рабочее пространство состоит из панели компонентов, области построения Сценария и панели инструментов (см.
en: Working space consists of a panel of components, toolbar and area of the Workflow construction (refer to

source: Равномерность.
en: Uniformity.

source: Радиокнопкой необходимо выбрать один из предоставляемых SOAP-сервисом методов (операций).
en: The radio button is used to select one of the methods (operations) provided by SOAP service.

source: Разбиение на множества применяется в случае, когда задача анализа требует разделить исходный набор данных на обучающую и тестовую выборки.
en: Partitioning is used when according to the analysis task it is required to divide the source data set into the training and test samples.

source: Развитием идеи повторного использования ранее созданных алгоритмов является создание библиотек универсальных функций.
en: Creation of libraries of universal functions represents development of idea of usage of earlier created algorithms.

source: Разгруппированное значение
en: Ungrouped value

source: Разгруппируемые данные:
en: Ungrouped data:

source: Разгруппируемый ряд.
en: Ungrouped Series.

source: Раздел представляет из себя таблицу, с кнопками управления над ней:
en: The section is a table with control buttons over it:

source: Разделителем может быть Двоеточие (:) или Точка (.).
en: Colon (:) or dot (.) can be used as delimiters.

source: Разделителем может быть Точка (.) или Запятая (,).
en: Dot (.) or comma (,) can be used as delimiters.

source: Разделители:
en: Separators:

source: Различия между редакциями связаны с кейсами использования и механизмами интеграции в корпоративную IT-среду.
en: Differences between editions are connected with usage cases and mechanisms of integration into the corporate IT environment.

source: Различные драйвера для SQL Server
en: Different drivers for SQL Server

source: Размер (только для строкового поля) — максимальная длина строки, по умолчанию установлен равным 50.
en: Size (only for the string field): the maximum string length; by default, it is equal to 50.

source: Размер обучающего и тестового множества в процентах или строках.
en: Size of training and test set in percentage terms or in rows.

source: Размер сети по X.
en: Network size X.

source: Размер сети по Y.
en: Network size Y.

source: Размер сети по Z.
en: Network size Z.

source: Размер точки — возможное значение от 0 до 30.
en: Point size: possible value varies from 0 to 30.

source: Размер этих выборок можно настроить, а отбор записей для них производится на основе выбранного метода сэмплинга.
en: It is possible to configure the size of these samples, and records are selected for them using the selected sampling method.

source: Размерность группы задается в параметрах метода.
en: The group dimension is set in the method parameters.

source: Размеры сэмплированного и неиспользованного множеств настраиваются в параметрах метода.
en: The sizes of sampling and unused sets are configured in the method parameters.

source: Разработка аналитических моделей — нетривиальная задача, требующая понимания методики анализа и особенностей ведения бизнеса.
en: Development of the analytical models is a specific task. It is required to understand the analysis methods and peculiarities of business operations.

source: Разработка сценария ведется в специальной зоне — области построения Сценария, которая расположена справа.
en: The workflow is designed in the special zone, namely, in the workflow construction area that is located to the right.

source: Разработчик сценария должен находить оптимальное соотношение этих параметров.
en: The workflow developer must provide the optimal balance of these parameters.

source: Разрядность LGD-файла зависит от разрядности используемого сервера Loginom.
en: Bitness of the LGD file depends on bitness of the used Loginom server.

source: Распознано
en: Recognized

source: Расположив несколько узлов на рабочем пространстве и соединив их между собой, получится Сценарий, запустить который можно с помощью последовательной (каждый узел отдельно) или одновременной активации узлов.
en: It is possible to create the Workflow by placing several nodes into the working space and connecting them with each other. The Workflow is started by the sequential (each node is separately activated) or simultaneous activation of nodes.

source: Рассмотрим цветовую индикацию на примере интерфейса «Таблица».
en: Let's analyze the color indication using "Table" interface as an example.

source: Расстояние Дамерау-Левенштейна также называют расстоянием редактирования с учетом перестановок, которое является мерой похожести двух строк.
en: The Damerau–Levenshtein distance is also called the edit distance with reference to transpositions that is the similarity of measurement of the two strings.

source: Расстояние Левенштейна также называют расстоянием редактирования, которое является мерой похожести двух строк.
en: The Levenshtein distance is also called the edit distance that is the similarity of measurement of the two strings.

source: Рассчитать доверительный интервал.
en: Calculate confidence interval.

source: Расчетное значение уравнения регрессии (изменяется от 0 до 1)
en: Calculated value of regression equation (changes from 0 to 1)

source: Расчеты производятся над последовательностью сомволов Строки в кодировке UTF-8.
en: Calculations are performed with the String characters sequence using UTF-8 encoding.

source: Расш.Синтаксис - расширенный синтаксис замены (только для PCRE2)
en: ExtendedSyntax - extended replacement syntax (only for PCRE2).

source: Реализация методов сервиса
en: Implementation of the Service Methods

source: Реализованная в Подмодели логика может быть произвольной, при этом разработчик сценария может рассматривать её как «черный ящик».
en: Random logics can be implemented in the Supernode. At the same time, the workflow handler can consider it as the "black box".

source: Реализованная в подмодели логика может быть произвольной, при этом разработчик сценария может рассматривать её как «черный ящик».
en: Random logics can be implemented in the supernode. At the same time, the workflow handler can consider it as the "black box".

source: Реализует функциональность IF - THEN - ELSE, при этом результат функции имеет строковый тип.
en: Implements IF - THEN - ELSE feature and the function result is related to the string type.

source: Реализует функциональность IF - THEN - ELSE, при этом результат функции имеет числовой тип или тип Дата/Время.
en: Implements IF - THEN - ELSE feature and the function result is related to the numeric or Date/Time type.

source: Реализует функциональность IF - THEN - ELSE, при этом результат функции, также как и все ее аргументы, имеют числовой тип или тип Дата/Время.
en: Implements IF - THEN - ELSE feature and the function result as all its arguments are related to the numeric or Date/Time type.

source: Реализует функциональность IF - THEN - ELSE.
en: Implements IF - THEN - ELSE feature.

source: Рег.Выр.
en: RegularExpression

source: Регион
en: Region

source: Регуляризация позволяет снизить эффективное число степеней свободы модели, избежав тем самым переобучения.
en: The decay enables to decrease the effective number of the model degrees of freedom, thereby avoiding overfitting.

source: Регулярное выражение \D обозначает все символы, не являющиеся цифрами.
en: The regular expression \D: all characters that are not digits.

source: Редактирование возможно лишь для Черновика.
en: Editing is possible only for the Draft.

source: Редактирование ячейки осуществляется путем выбора из списка полей/переменных входного набора порта.
en: Cell editing is performed by selecting from the list of fields/variables of the input data set of the port.

source: Режим поиска определяет очередность подсветки найденных значений:
en: The search mode enables to define the highlighting order of the found values:

source: Режим расчета статистики:
en: Statistics calculation mode:

source: Режим сравнения определяет позицию искомого фрагмента:
en: The comparison mode defines position of the searched fragment:

source: Результат - выражение, которое возвращается, если Выражение = Значение.
en: Result - the expression that is returned if the Expression = the Value.

source: Результат - это минимальное количество операций удалений, вставки и замены символа, которое нужно произвести, чтобы преобразовать одну строку в другую.
en: Its result is the minimum number of the character deletion, insertion and substitution operations that must be performed in order to convert one string into another.

source: Результат - это минимальное количество операций удалений, вставки, замены и перестановок символов, которое нужно произвести, чтобы преобразовать одну строку в другую.
en: Its result is the minimum number of the character deletion, insertion, substitution and transposition operations that must be performed in order to convert one string into another.

source: Результат для каждого метода будет записан в отдельный столбец.
en: The result for each method will be recorded in a separate column.

source: Результат замены
en: Replacement result

source: Результат преобразования списка переменных:
en: Result of the variables list transformation:

source: Результат проведенной замены
en: Result of the performed replacement

source: Результат сравнения строк зависит от локали операционной системы сервера Loginom.
en: The string comparison result depends on the operational system locale of the Loginom server.

source: Результат функции имеет переменный тип
en: The function result has the variant type

source: Результат — таблица, количество записей которой соответствует числу кластеров, т.е. данные сгруппированы по кластерам.
en: Result is a table the number of records of which complies with the number of clusters, namely, the data is grouped by clusters.

source: РезультатN - выражение строкового типа, которое возвращается, если Выражение = ЗначениеN.
en: ResultN - the expression of the string type that is returned if the Expression = ValueN.

source: РезультатN - выражение числового типа или типа Дата/Время, которое возвращается, если Выражение = ЗначениеN.
en: ResultN - the expression of the numeric or Date/Time type that is returned if the Expression = ValueN.

source: РезультатN - значение, которое возвращается, если |ЗначениеN - ВыражениеN| <= Погрешность.
en: ResultN - the value that is returned if |ValueN - ExpressionN| <= Error.

source: Результатом работы обработчика Конечные классы является преобразование входных столбцов в последовательность интервалов, называемых конечными классами, каждому из которых присваивается определенная метка.
en: The Coarse Classes handler operation result is conversion of the input columns into a sequence of bins that are called coarse classes, each of which is assigned with a particular caption.

source: Результаты можно просмотреть в самой системе или экспортировать в сторонние приемники данных.
en: It is possible to view results in the system or to export them to the external data receivers.

source: Результаты обработки и анализа данных необходимо выгружать во внешние источники.
en: It is required to upload data processing and analysis results to the external sources.

source: Результирующая таблица
en: Resulting table

source: Результирующая таблица при значении Оставлять неполные записи:
en: The resulting table in the case of Leave incomplete records value:

source: Результирующая таблица при значении Удалять все неполные записи:
en: The resulting table in the case of Delete all incomplete records value:

source: Результирующая таблица при значении Удалять добавленные неполные записи:
en: The resulting table in the case of Delete added incomplete records value:

source: Результирующая таблица:
en: Resulting table:

source: Результирующий набор данных содержит все строки, для которых найдено совпадение ключевых полей главной и присоединяемой таблицы.
en: The resulting data set contains all rows for which mapping of the key fields of the main and joined table has been detected.

source: Результирующий набор данных содержит записи основного набора, для которых по ключевым полям не найдено соответствий в присоединяемом наборе.
en: The resulting data set contains records of the main data set for which there is no detected mapping by the key fields in the joined data set.

source: Результирующий набор данных содержит:
en: The resulting data set contains the following columns:

source: Результирующий набор данных:
en: Resulting data set:

source: Результирующий набор состоит из столбцов исходного набора данных и столбцов, рассчитанных обработчиком, их описание приведено в таблице:
en: The resulting data set consists of the source data set columns and the columns calculated by the handler. They are described in the table:

source: Рекомендуемые
en: Recommended

source: Рекомендуется в качестве события всегда назначать редкий класс (такой вариант предлагается по умолчанию).
en: It is recommended to assign the rare class (such option is offered by default) always as an event.

source: Рекомендуется в случае, если пользователь не намерен изменять разбиение на конечные классы с учетом новых данных.
en: It is recommended when a user does not intend to change the coarse classes binning taking into account the new data.

source: Рекомендуется выбирать, когда требуется обеспечить высокую интерпретируемость результатов факторного анализа.
en: It is recommended to choose when it is required to provide the high interpretability level of the factor analysis results.

source: Рекомендуется использовать для категориальных данных.
en: It is recommended to use for categorical data.

source: Рекомендуется использовать ее при большом числе уникальных значений в непрерывном поле.
en: It is recommended to use it when there are many unique values in the continuous field.

source: Рекомендуется не применять нормализацию для данных временного ряда, для данных внешних факторов не менять настройки по умолчанию.
en: It is recommended not to use normalization for the time series data, not to change default settings for the exogenous factors data.

source: Рекомендуется применять Кэширование при использовании функций, результат которых зависит от момента времени, в которое происходит это вычисление, например: Random(), Today() и других.
en: It is recommended to use Caching when using the functions the result of which depends on the time point when this calculation is performed, for example: Random(), Today(), etc.

source: Решает задачу классификации — в выходном наборе нейросеть соотносит множество входных параметров (предикторов) с одним из заранее известных классов:
en: It handles the task of classification: the neural network in the output data set correlates a set of input parameters (independent variables) with one of the classes known in advance:

source: Решает задачу регрессии — в выходном наборе Нейросеть выдаст прогнозируемое значение для одной или нескольких переменных, зависимых от множества входных параметров.
en: It handles the task of regression: the Neural Network in the output data set will provide the forecast value for one or several variables that depend on the input parameters set.

source: Рис 1).
en: Figure 1).

source: Рис 1):
en: Figure 1):

source: Розовая шипучка
en: Pink sparkling water

source: Ростовская обл.
en: The Rostov Region

source: Ручная настройка осуществляется с помощью элементов управления:
en: Manual setting is performed using the following control elements:

source: Ряд узлов Сценария, такие как Кросс-таблица, не имеют постоянной структуры выходных данных.
en: Some Workflow nodes, for example, Cross table, do not have the constant structure of the output data.

source: Рядом с заголовком каждого столбца есть кнопка , нажатием на которую вызывается выпадающее меню.
en: There is button near the header of each column. Its pressing enables to call the drop-down menu.

source: С базами данных платформы 1С:Предприятие версий 8.x.
en: with the 1C:Enterprise 8.x platform databases.

source: С выбранным пунктом На пропущенное, данная таблица имела бы такой вид
en: When With empty option is selected, this table would be as follows:

source: С помощью кнопок Вверх и Вниз можно менять порядок полей в группе.
en: Using Up and Down buttons, it is possible to change the order of fields in the group.

source: С помощью компонента Выполнение программы можно выполнить внешнюю программу (запустить на выполнение исполняемый файл).
en: Component execution component enables to execute the external program (to start execution of the executed file).

source: С помощью компонента Выполнение программы можно запустить на выполнение внешнюю программу (исполняемый файл: cmd, bat, exe и т.д.)
en: Program Execution component can start execution of the external program (there are the following executed files: cmd, bat, exe, etc.)
